app/controllers/users_controller.rb

  def show
    @user = User.find_by(userid: params[:userid])
---
SELECT  "users".* FROM "users" WHERE "users"."userid" = ? LIMIT ?  [["userid", "tanaka"], ["LIMIT", 1]]

  def following
    @title = "Following"
    @user  = User.find_by(userid: params[:userid])
    @users = @user.following.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."userid" = ? LIMIT ?  [["userid", "tanaka"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (tanaka) LIMIT ?  [["LIMIT", 1]]

  def followers
    @title = "Followers"
    @user  = User.find_by(userid: params[:userid])
---
SELECT  "users".* FROM "users" WHERE "users"."userid" = ? LIMIT ?  [["userid", "tanaka"], ["LIMIT", 1]]